**Conexi칩n a la Base de Datos**

import sqlite3

conn = sqlite3.connect('database.sqlite')

cursor = conn.cursor()

print("Conectado correctamente")

**Creaci칩n de la Tabla**

cursor.execute('''CREATE TABLE Nombre

         (ID INT PRIMARY KEY     NOT NULL,
         
         Campo1           TEXT    NOT NULL,
         
         Campo2            INT     NOT NULL);''')
         
cursor.close()

In [1]:
import sqlite3

conn = sqlite3.connect('test_database') 
c = conn.cursor()

c.execute('''
          CREATE TABLE IF NOT EXISTS products
          ([product_id] INTEGER PRIMARY KEY, [product_name] TEXT, [price] INTEGER)
          ''')

**Borrar Datos**

import sqlite3

conn = sqlite3.connect('my_database.sqlite')

cursor = conn.cursor()

conn.execute("DELETE from  Table where Campo = Valor")

conn.commit()

conn.close()

In [2]:
conn.execute ("DELETE from products")
conn.commit()

**Inserci칩n de Valores**

import sqlite3

conn = sqlite3.connect('database.sqlite')

cursor = conn.cursor()

cursor.execute("INSERT INTO EMPLEADOS (ID,NAME,AGE) \

      VALUES (1, 'Razi', 14')");
      
cursor.execute("INSERT INTO EMPLEADOS (ID,NAME,AGE,ADDRESS,MARKS) \

      VALUES (2, 'Jon', 19, 'Bangalore', 150 )");
      
cursor.execute("INSERT INTO EMPLEADOS (ID,NAME,AGE) \

      VALUES (3, 'Martha', 35)");
      
conn.commit()

conn.close()

In [3]:
c.execute('''
          INSERT INTO products (product_id, product_name, price)

                VALUES
                (1,'Computadora',800),
                (2,'Impresora',200),
                (3,'Tablet',300),
                (4,'Escritorio',450),
                (5,'Silla',150)
          ''')                     

conn.commit()

In [4]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('test_database') 
          
sql_query = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM products
                               ''', conn)

Tabla = pd.DataFrame(sql_query, columns = ['product_id', 'product_name', 'price'])
print (Tabla)

   product_id product_name  price
0           1  Computadora    800
1           2    Impresora    200
2           3       Tablet    300
3           4   Escritorio    450
4           5        Silla    150

In [5]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('test_database') 
c = conn.cursor()
                 
c.execute('''
          SELECT
          *
          FROM products
          ''')

Tabla = pd.DataFrame(c.fetchall(), columns = ['product_id', 'product_name', 'price'])
print (Tabla)

   product_id product_name  price
0           1  Computadora    800
1           2    Impresora    200
2           3       Tablet    300
3           4   Escritorio    450
4           5        Silla    150

In [6]:
max_price = Tabla['price'].max()
print (max_price)

800

In [7]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('test_database') 
c = conn.cursor()
                 
c.execute('''
          SELECT
          *
          FROM products
          ''')

Tabla = pd.DataFrame(c.fetchall(), columns = ['producto_id', 'producto_name', 'price'])

max_precio = Tabla['price'].max()
min_precio = Tabla['price'].min()
print (max_price)
print (min_precio)

800
150

In [8]:
Tabla

   producto_id producto_name  price
0            1   Computadora    800
1            2     Impresora    200
2            3        Tablet    300
3            4    Escritorio    450
4            5         Silla    150